Capstone Two Data Wrangling

The goal of this Data Wrangling piece is to get the Date column in the proper format, as well and handle any missing values.

In [1]:
import os
import pandas as pd
import matplotlib.pyplot as plt
import datetime

In [2]:
df = pd.read_csv('GlobalLandTemperaturesByCountry.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 577462 entries, 0 to 577461
Data columns (total 4 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   dt                             577462 non-null  object
 1   AverageTemperature             544811 non-null  float64
 2   AverageTemperatureUncertainty  545550 non-null  float64
 3   Country                        577462 non-null  object
dtypes: float64(2), object(2)
memory usage: 17.6+ MB

In [4]:
#Get the shape of the dataset.
df.shape

(577462, 4)

In [5]:
#View the first 10 rows.
df.head(10)

           dt  AverageTemperature  AverageTemperatureUncertainty Country
0  1743-11-01               4.384                          2.294   Åland
1  1743-12-01                 NaN                            NaN   Åland
2  1744-01-01                 NaN                            NaN   Åland
3  1744-02-01                 NaN                            NaN   Åland
4  1744-03-01                 NaN                            NaN   Åland
5  1744-04-01               1.530                          4.680   Åland
6  1744-05-01               6.702                          1.789   Åland
7  1744-06-01              11.609                          1.577   Åland
8  1744-07-01              15.342                          1.410   Åland
9  1744-08-01                 NaN                            NaN   Åland

In [6]:
#Unique values for each column.
df.nunique()

dt                                3239
AverageTemperature               76605
AverageTemperatureUncertainty     8979
Country                            243
dtype: int64

In [7]:
#Convert date column to Datetime.
df['dt'] = pd.to_datetime(df['dt'], errors='coerce')

In [8]:
#Rename column.
df.rename(columns={'dt':'Date'},inplace=True)

In [9]:
#Confirm column name.
df.head()

        Date  AverageTemperature  AverageTemperatureUncertainty Country
0 1743-11-01               4.384                          2.294   Åland
1 1743-12-01                 NaN                            NaN   Åland
2 1744-01-01                 NaN                            NaN   Åland
3 1744-02-01                 NaN                            NaN   Åland
4 1744-03-01                 NaN                            NaN   Åland

In [10]:
#Check the data type of the Date column.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 577462 entries, 0 to 577461
Data columns (total 4 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   Date                           577462 non-null  datetime64[ns]
 1   AverageTemperature             544811 non-null  float64
 2   AverageTemperatureUncertainty  545550 non-null  float64
 3   Country                        577462 non-null  object
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 17.6+ MB

In [11]:
#The Count and Percentage of missing data per column.
missing_data = pd.concat([df.isnull().sum(), 100 * df.isnull().mean()], axis =1)
missing_data.columns=['count','%']
missing_data.sort_values(by='count',ascending=False)

                               count         %
AverageTemperature             32651  5.654225
AverageTemperatureUncertainty  31912  5.526251
Date                               0  0.000000
Country                            0  0.000000

In [12]:
#Check to see how many rows are missing both Temp columns, or just 1.
missing_temp = df[['AverageTemperature','AverageTemperatureUncertainty']].isnull().sum(axis=1)
missing_temp.value_counts()/len(missing_temp)*100

0    94.345775
2     5.526251
1     0.127974
dtype: float64

In [13]:
#View Countries with the most missing values.
missing = df[df['AverageTemperature'].isnull()]
missing['Country'].value_counts().head(15)

Mauritius           1039
Reunion             1039
Mayotte              958
Comoros              958
Seychelles           958
Madagascar           958
Antarctica           764
Niger                585
Bahamas              572
United States        459
North America        459
Canada               437
Christmas Island     386
Indonesia            386
Tanzania             370
Name: Country, dtype: int64

In [14]:
#Use 'Ffill' method to replace NaN values.
df = df.fillna(method = 'ffill')

In [15]:
#Confirm there are no more NaN values
missing_data = pd.concat([df.isnull().sum(), 100 * df.isnull().mean()], axis =1)
missing_data.columns=['count','%']
missing_data.sort_values(by='count',ascending=False)

                               count    %
Date                               0  0.0
AverageTemperature                 0  0.0
AverageTemperatureUncertainty      0  0.0
Country                            0  0.0

In [16]:
df.head(10)

        Date  AverageTemperature  AverageTemperatureUncertainty Country
0 1743-11-01               4.384                          2.294   Åland
1 1743-12-01               4.384                          2.294   Åland
2 1744-01-01               4.384                          2.294   Åland
3 1744-02-01               4.384                          2.294   Åland
4 1744-03-01               4.384                          2.294   Åland
5 1744-04-01               1.530                          4.680   Åland
6 1744-05-01               6.702                          1.789   Åland
7 1744-06-01              11.609                          1.577   Åland
8 1744-07-01              15.342                          1.410   Åland
9 1744-08-01              15.342                          1.410   Åland

In [17]:
#Save file
df.to_csv('Cleaned_Temperature_Data.csv', index=False)